#+title: 󱄅 NixOS Config 󱄅
# #+PROPERTY: header-args:nix :tangle configuration.nix :exports code
#+PROPERTY: header-args:nix :tangle configuration.nix
- ~/.dotfiles/flake.nix
- ~/.dotfiles/configuration.nix
- [[elisp:(org-babel-tangle)][Tangle file]]
- [[*Packages to clean up][Packages to clean up]]

I had tried to use this so that I could tangle it easily. At the moment, it is an absolute mess. Don't tangle this file.

*** Installing from the stable channel.
We have to bootstrap it before we can use it properly.

#+begin_src bash
nix-channel --add https://github.com/nix-community/home-manager/archive/release-25.05.tar.gz home-manager
nix-channel --update
#+end_src

#+RESULTS:

We then open up a nix shell and install it
#+begin_src bash
nix-shell '<home-manager>' -A install
#+end_src

This has created the file at =~/.config/home-manager/home.nix=. I will then move it to where my flake is at

#+begin_src bash
mv ~/.config/home-manager/home.nix ~/.dotfiles/
#+end_src

#+RESULTS:
Which will place it at: =~/.dotfiles/home.nix=

I then tweaked the inputs and outputs within =~/.dotfiles/flake.nix=.

#+begin_src nix
home-manager.url = "github:nix-community/home-manager/archive/release-25.05";
home-manager.inputs.nixpkgs.follows = "nixpkgs"; # to ensure that it has access to nixpkgs
#+end_src

